'''
|Задание 1| Дан список из чисел. Напишите программу, которая удаляет
все четные числа из списка и выводит список через print()
nums = [14, 21, 565, 18, 33, 20, 102, 108, 167, 891, 400]

|Задание 2| Дан список слов. Напишите программу, которая находит
слова длиннее 4 букв и записывает их в другой список.
sentence = ['The', 'quick', 'brown', 'fox', 'jumps',
            'over', 'the', 'lazy', 'dog']

|Задание 3| Создайте список квадратов от 1 до 30. Выведите
первые 5 и последние 5 элементов списка.
'''

